INTRO = (
    "‼️ Уважаемый пользователь, сейчас наш сервис находится на стадии тестирования. "
    "Если вы столкнетесь с какой-либо проблемой в работе сервиса, пожалуйста воспользуйтесь командой /bug и сообщите нам о ней. 🫡"
    "\n\n‼️Уникальная акция! Пользователи, нашедшие баг в работе сервиса и сообщившие об этом нам (команда /bug), а также пользователи, отправившие предложения по разработке, которые будут приняты и внедрены (также команда /bug) получают 100 рублей на счет или 1 месяц бесплатного пользования сервисом по базовому тарифу!🤑 "
)
"""Вступительное сообщение.

Воспроизводится по команде /start"""
